src/DataProcessors/bz_КонтрольНормыВыработки/bz_КонтрольНормыВыработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>bz_КонтрольНормыВыработки</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группировка</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПревышение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНехватку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/bz_НормыВыработки/bz_НормыВыработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>bz_НормыВыработки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика</name>
    <type>
      <types>CatalogRef.bz_Проекты</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.bz_ЭтапыПроектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ДанныеПроизводственногоКалендаря/ДанныеПроизводственногоКалендаря.mdo
<<<<<<< HEAD
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4a69a70d-1b4c-4999-a3dd-ae1deb331fea">
  <name>ДанныеПроизводственногоКалендаря</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="3a36e0f5-a645-47f1-99ae-5b0493d604ad">
    <name>ВидДня</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="ca7d4086-de35-40fd-af65-73369d452135">
    <name>ПроизводственныйКалендарь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="563c0f5c-e0b4-4229-a3f6-183091060aa4">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="bf967588-ea8f-49a3-9331-af2331ffa162">
    <name>Год</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>
=======
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4a69a70d-1b4c-4999-a3dd-ae1deb331fea">
  <name>ДанныеПроизводственногоКалендаря</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="3a36e0f5-a645-47f1-99ae-5b0493d604ad">
    <name>ВидДня</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="ca7d4086-de35-40fd-af65-73369d452135">
    <name>ПроизводственныйКалендарь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="563c0f5c-e0b4-4229-a3f6-183091060aa4">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="bf967588-ea8f-49a3-9331-af2331ffa162">
    <name>Год</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>
>>>>>>> refs/remotes/origin/develop

src/AccumulationRegisters/bz_Выработка/bz_Выработка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>bz_Выработка</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Трудозатраты</name>
    <comment>Трудозатраты (в часах дробно)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудозатратыМинуты</name>
    <comment>Трудозатраты (в минутах)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыставлено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудозатратыВыставлено</name>
    <comment>Трудозатраты (в часах дробно)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТрудозатратыДляСогласования</name>
    <comment>Трудозатраты (в часах дробно)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДляСогласования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПВР</name>
    <type>
      <types>CatalogRef.bz_ПозицияВыполненияРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыЧД</name>
    <comment>Трудозатраты (часы, как в документе)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыМД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.bz_Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.bz_ЭтапыПроектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef.bz_Работы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыДнейПроизводственногоКалендаря/ВидыДнейПроизводственногоКалендаря.mdo
<<<<<<< HEAD
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9f7290dd-19f4-4163-9795-fe562e84f06d">
  <name>ВидыДнейПроизводственногоКалендаря</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c3b5c81f-b787-4f63-8cba-79def0921477">
    <name>Рабочий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1f0cb3d4-1344-451b-a257-be3cd854acfd">
    <name>Суббота</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0131fe59-ce47-48b7-8f7e-1544bf0fa031">
    <name>Воскресенье</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c8b0a1be-97c6-4a16-b1dd-31901ac61cdc">
    <name>Предпраздничный</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="372150e2-526e-4424-8c54-e4b16bdd25b5">
    <name>Праздник</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2f9c347d-ee82-49f2-a5eb-97f55374856f">
    <name>Нерабочий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>
=======
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9f7290dd-19f4-4163-9795-fe562e84f06d">
  <name>ВидыДнейПроизводственногоКалендаря</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c3b5c81f-b787-4f63-8cba-79def0921477">
    <name>Рабочий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1f0cb3d4-1344-451b-a257-be3cd854acfd">
    <name>Суббота</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0131fe59-ce47-48b7-8f7e-1544bf0fa031">
    <name>Воскресенье</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c8b0a1be-97c6-4a16-b1dd-31901ac61cdc">
    <name>Предпраздничный</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="372150e2-526e-4424-8c54-e4b16bdd25b5">
    <name>Праздник</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2f9c347d-ee82-49f2-a5eb-97f55374856f">
    <name>Нерабочий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>
>>>>>>> refs/remotes/origin/develop

src/DataProcessors/bz_КонтрольНормыВыработки/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормы//<ИмяТаблицыФормы>
//
//// Код процедур и функций
//
//#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	ТекстОшибки = СформироватьНаСервере();
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ПоказатьПредупреждение(, ТекстОшибки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	bz_НормыВыработки.Период КАК Дата1,
	|	bz_НормыВыработки.СрокДействия КАК Дата2,
	|	bz_НормыВыработки.Сотрудник,
	|	bz_НормыВыработки.Аналитика,
	|	bz_НормыВыработки.Норма
	|ИЗ
	|	РегистрСведений.bz_НормыВыработки КАК bz_НормыВыработки
	|ГДЕ
	|	bz_НормыВыработки.Период < &Дата2
	|	И (bz_НормыВыработки.СрокДействия >= &Дата1
	|	ИЛИ bz_НормыВыработки.СрокДействия = ДАТАВРЕМЯ(1, 1, 1))
	|	И bz_НормыВыработки.Сотрудник = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата,
	|	ДанныеПроизводственногоКалендаря.ВидДня
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	bz_ВыработкаОбороты.Проект КАК Проект,
	|	bz_ВыработкаОбороты.Этап КАК Этап,
	|	bz_ВыработкаОбороты.Сотрудник КАК Сотрудник,
	|	bz_ВыработкаОбороты.Период КАК Период,
	|	СУММА(bz_ВыработкаОбороты.ТрудозатратыОборот) КАК Трудозатраты,
	|	bz_ВыработкаОбороты.Проект.КонтрагентРаботодатель КАК КонтрагентРаботодатель,
	|	bz_ВыработкаОбороты.Проект.Менеджер КАК Менеджер
	|ИЗ
	|	РегистрНакопления.bz_Выработка.Обороты(&Дата1, &Дата2, День, Сотрудник = &Сотрудник) КАК bz_ВыработкаОбороты
	|СГРУППИРОВАТЬ ПО ГРУППИРУЮЩИМ НАБОРАМ
	|(
	|	(bz_ВыработкаОбороты.Период,
	|	bz_ВыработкаОбороты.Сотрудник),
	|	(bz_ВыработкаОбороты.Период,
	|	bz_ВыработкаОбороты.Сотрудник,
	|	bz_ВыработкаОбороты.Проект.КонтрагентРаботодатель),
	|	(bz_ВыработкаОбороты.Период,
	|	bz_ВыработкаОбороты.Сотрудник,
	|	bz_ВыработкаОбороты.Проект,
	|	bz_ВыработкаОбороты.Этап)
	|)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Период
	|ИТОГИ
	|ПО
	|	Сотрудник";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Объект.Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Объект.Дата2));
	Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
	
	
	РезультатПакета=Запрос.ВыполнитьПакет();
	
	РезультатВидыДней = РезультатПакета[1];
	РезультатВыработка = РезультатПакета[2];
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОтчетОбъект.ПолучитьМакет("Макет");
	
	ВидДняПоДате = ПолучитьСоответствиеВидДняПоДате(РезультатВидыДней);
	
	ТабДок.Очистить();
	#Область Шапка 
		ОбластьШапкаГруппировка = Макет.ПолучитьОбласть("Шапка|Группировка");
		ОбластьШапкаПоказатель = Макет.ПолучитьОбласть("Шапка|Показатель");
		ОбластьШапкаИтогЧ = Макет.ПолучитьОбласть("Шапка|ИтогЧ");
		ОбластьШапкаИтогСумма = Макет.ПолучитьОбласть("Шапка|ИтогСумма");
		ОбластьШапкаДень = Макет.ПолучитьОбласть("Шапка|День");
		
		ТабДок.Вывести(ОбластьШапкаГруппировка);
		ТабДок.Присоединить(ОбластьШапкаГруппировка);
		ТабДок.Присоединить(ОбластьШапкаПоказатель);
		ТабДок.Присоединить(ОбластьШапкаИтогЧ);
		ТабДок.Присоединить(ОбластьШапкаИтогСумма);
		
		ТекДата = Объект.Дата1;
		Сутки = 60*60*24;
		НомерДняНедели = ДеньНедели(ТекДата)-1; 
		АкронимыДнейНедели = ПолучитьАкронимыДнейНедели();
		Пока ТекДата <= Объект.Дата2 Цикл
			ОбластьШапкаДень.Параметры.День = СтрШаблон("%1, %2", Формат(ТекДата, "ДФ=dd.MM;"), АкронимыДнейНедели[НомерДняНедели]);
			ТекОбласть = ТабДок.Присоединить(ОбластьШапкаДень);
			ТекВидДня = ВидДняПоДате[ТекДата];
			
			Если ТекВидДня = Неопределено Тогда
				ТекстОшибки = СтрШаблон(НСтр("ru='Не заполнен рабочий календарь на дату %1'"), ТекДата);
				Возврат ТекстОшибки;
			КонецЕсли;
			
			ПокраситьОбластьПоВидуДня(ТекВидДня, ТекОбласть);
			
			ТекДата = ТекДата + Сутки;
			НомерДняНедели = (НомерДняНедели + 1) % 7;
		КонецЦикла;
		
	#КонецОбласти
	
	ВыборкаСотрудник = РезультатВыработка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСотрудник.Следующий() Цикл
	КонецЦикла;
	
	Возврат "";
КонецФункции

&НаСервере
Процедура ПокраситьОбластьПоВидуДня(Знач ТекВидДня, ТекОбласть)
	Если ТекВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота или ТекВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье Тогда  
		ТекОбласть.ЦветФона = WebЦвета.СеребристоСерый;
	ИначеЕсли ТекВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Нерабочий или ТекВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда
		ТекОбласть.ЦветФона = WebЦвета.СветлоКоралловый;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАкронимыДнейНедели()
	Результат = Новый Массив();
	Результат.Добавить("пн");
	Результат.Добавить("вт");
	Результат.Добавить("ср");
	Результат.Добавить("чт");
	Результат.Добавить("пт");
	Результат.Добавить("сб");
	Результат.Добавить("вс");
	
	Возврат Результат;
КонецФункции

// Получить соответствие вид дня по дате.
// 
// Параметры:
//  РезультатВидыДней - РезультатЗапроса - Результат виды дней
// 
// Возвращаемое значение:
//  Соответствие - Получить соответствие вид дня по дате
&НаСервереБезКонтекста
Функция ПолучитьСоответствиеВидДняПоДате(знач РезультатВидыДней)
	Результат = Новый Соответствие();
	Выборка = РезультатВидыДней.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Дата, Выборка.ВидДня);
	КонецЦикла;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
